var str = 'number';
console.log(str + 3 + 3); //результат number33, відбувається конкатенація

var age = null;
console.log(age+3); //результат 3, відбувається додавання до порожнього значення і null перетворюється на 0, тому виконується математична дія

var result = 5 && "qwerty";
console.log(result); //результат qwerty, виконується логічна операція І, всі значення правдиві

var result = +'40' + +'2' + "hillel";
console.log(result); //результат 42hillel, додавання унарного плюса перед стрінгою перетворює її на число і відбуається додавання чисел а потім конкатенація з стрінгою

var result = '10' - 5 === 6;
console.log(result); //результат False, відбувається математична операція віднімання і після оператор строго порівняння

var result = true + false;
console.log(result); //при додаванні двох логічних значень відбувається перетворення їх в число, результат 1

var result = '4px' - 3;
console.log(result); //результат NaN, не можемо перетворити стрінгу в число тому матиматична дія неможлива

var result = '4' - 3;
console.log(result); //результат 1, стрінг перетворюється на число і відбувається матиматична дія

var result = '6' + 3 ** 0;
console.log(result); //результат 61, відбувається піднесення трійки до степеня а потім конкатенація

var result = 12 / '6';
console.log(result); //результат 2, стрінг перетворюється на число і відбувається матиматична дія

var result = '10' + (5 === 6);
console.log(result); //результат 10false, вираз в дужках має приорітет, відбувається строге порівння з результатом false і після конкатенація з стрінгом

var result = null == '';
console.log(result); //результат false, при не строгому порівнянні на null діє окреме правило, воно не перетворюється в інший тип данних і не дорівнює нічому іншому

var result = 3 ** (9 / 3);
console.log(result); //результат 27, вираз в дужках має приорітет відбувається ділення, після відбувається піднесення до степеня числа 3, результату дії в дужках 

var result = !!'false' == !!'true';
console.log(result); //результат true, два !! приводять значення до логічного заперечення і відбувається порівння двох однакових значень

var result = 0 || '0' && 1;
console.log(result); //результат 1, приорітет у логічного І з результатом 1, потім логічне АБО і так як хоч одне значення істина то воно і виводиться

var result = (+null == false) < 1;
console.log(result); //результат false, приорітет дія в дужках, в них до null додається унарний плюс і перетворює на число, далі йде порівняння нуля до нуля = true, далі порівняння 1 < 1 що = не правильно.

var result = false && true || true;
console.log(result); //результат true, приорітет логічного І з результатом false, потім логічне АБО і так як хоч одне значення істина то воно і виводиться

var result = false && (false || true);
console.log(result); //результат false, приорітет дія в дужках, в них отримуємо true, далі логічне І з результатом false

var result = (+null == false) < 1 ** 5;
console.log(result); //результат false, приорітет дія в дужках, в них до null додається унарний плюс і перетворює на число, з порівняння отримуємо 1, 1 в степерні отримуємо 1,  далі порівняння 1 < 1 = не правильно.